11/data/attachments/c2885cdd2262b350.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Derek_own_Friend_91174_6</nif:username>
            <nif:friendToBeRequested>soap_friends_4ec86680-0f92-46e3-bcfb-16e9b8c56b92</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>